dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	for (unsigned i = 1; i < (32); ++i) {

		// We can ignore the very first data point as it's the pulse before it starts.
		if (i > 1) {

			if (dshot_capture_buffer[output_channel][i] == 0) {
				// Once we get zeros we're through.
				break;
			}

			// This seemss to work with dshot 150, 300, 600, 1200
			// The values were found by trial and error to get the quantization just right.
			const uint32_t bits = (dshot_capture_buffer[output_channel][i] - previous + 5) / 20;

			for (unsigned bit = 0; bit < bits; ++bit) {
				value = value << 1;
				value |= high;
				++shifted;
			}

			// The next edge toggles.
			high = !high;
		}

		previous = dshot_capture_buffer[output_channel][i];
	}

	if (shifted == 0) {
		// no data yet, or this time
		++read_fail_zero;
		return 0;
	}

	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
	value = value << (21 - shifted);

	// Note: At 0 throttle, the value is 0x1AD6AE, so 0b110101101011010101110

	// From GCR to eRPM according to:
	// https://brushlesswhoop.com/dshot-and-bidirectional-dshot/#erpm-transmission
	unsigned gcr = (value ^ (value >> 1));

	uint32_t data = 0;

	// 20bits -> 5 mapped -> 4 nibbles
	for (unsigned i = 0; i < 4; ++i) {
		uint32_t nibble = nibbles_from_mapped(gcr & (0x1F)) << (4 * i);

		if (nibble == 0xff) {
			++read_fail_nibble;
			return 0;
		}

		data |= nibble;
		gcr = gcr >> 5;
	}

	unsigned shift = (data & 0xE000) >> 13;
	unsigned period = ((data & 0x1FF0) >> 4) << shift;
	unsigned crc = (data & 0xf);

	unsigned payload = (data & 0xFFF0) >> 4;
	unsigned calculated_crc = (~(payload ^ (payload >> 4) ^ (payload >> 8))) & 0x0F;

	if (crc != calculated_crc) {
		++read_fail_crc;
		return 0;
	}

	++read_ok;
	return period;
}

// unsigned calculate_period_from_erpm_frame(uint16_t* buffer, size_t buffer_size)
// {
// 	uint32_t value = 0;

// 	// We start off with high
// 	uint32_t high = 1;

// 	unsigned shifted = 0;
// 	unsigned previous = 0;

// 	for (unsigned i = 1; i < buffer_size; ++i) {

// 		// We can ignore the very first data point as it's the pulse before it starts.
// 		if (i > 1) {

// 			if (buffer[i] == 0) {
// 				// Once we get zeros we're through.
// 				break;
// 			}

// 			// This seemss to work with dshot 150, 300, 600, 1200
// 			// The values were found by trial and error to get the quantization just right.
// 			const uint32_t bits = (buffer[i] - previous + 5) / 20;

// 			for (unsigned bit = 0; bit < bits; ++bit) {
// 				value = value << 1;
// 				value |= high;
// 				++shifted;
// 			}

// 			// The next edge toggles.
// 			high = !high;
// 		}

// 		previous = buffer[i];
// 	}

// 	if (shifted == 0) {
// 		// no data yet, or this time
// 		++read_fail_zero;
// 		return 0;
// 	}

// 	// We need to make sure we shifted 21 times. We might have missed some low "pulses" at the very end.
// 	value = value << (21 - shifted);

// 	// Note: At 0 throttle, the value is 0x1AD6AE, so 0b110101101011010101110

// 	// From GCR to eRPM according to:
// 	// https://brushlesswhoop.com/dshot-and-bidirectional-dshot/#erpm-transmission
// 	unsigned gcr = (value ^ (value >> 1));

// 	uint32_t data = 0;

// 	// 20bits -> 5 mapped -> 4 nibbles
// 	for (unsigned i = 0; i < 4; ++i) {
// 		uint32_t nibble = nibbles_from_mapped(gcr & (0x1F)) << (4 * i);

// 		if (nibble == 0xff) {
// 			++read_fail_nibble;
// 			return 0;
// 		}

// 		data |= nibble;
// 		gcr = gcr >> 5;
// 	}

// 	unsigned shift = (data & 0xE000) >> 13;
// 	unsigned period = ((data & 0x1FF0) >> 4) << shift;
// 	unsigned crc = (data & 0xf);

// 	unsigned payload = (data & 0xFFF0) >> 4;
// 	unsigned calculated_crc = (~(payload ^ (payload >> 4) ^ (payload >> 8))) & 0x0F;

// 	if (crc != calculated_crc) {
// 		++read_fail_crc;
// 		return 0;
// 	}

// 	++read_ok;
// 	return period;
// }

#endif
